src/Catalogs/СтатьиЗатрат/СтатьиЗатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтатьиЗатрат</name>
  <comment>(Общ)</comment>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>НПНК_</name>
      <description>Статьи затрат по структуре Декларации по прибыли</description>
      </content>
      </content>
    </items>
  </predefined>
  <attributes>
    <name>ВидЗатрат</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ВидыЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусМатериальныхЗатрат</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.СтатусыМатериальныхЗатратНаПроизводство</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактерЗатрат</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ХарактерЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>ПостояннаяЗатрата</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Счет8Класса</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДекларацииПоНалогуНаПрибыль</name>
    <type>
      <types>CatalogRef.СтатьиНалоговыхДеклараций</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/ВидыЗатрат/ВидыЗатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЗатрат</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>Материальные</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ОплатаТруда</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ОтчисленияНаСоциальныеНужды</name>
  </enumValues>
  <enumValues>
    <name>Амортизация</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Прочие</name>
    <comment>(Общ)</comment>
  </enumValues>
</mdclass:Enum>

src/Enums/ХарактерЗатрат/ХарактерЗатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ХарактерЗатрат</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>БракВПроизводстве</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ВложенияВоВнеоборотныеАктивы</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>РасходыНаСбыт</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ОбщепроизводственныеРасходы</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>АдминистративныеРасходы</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПроизводственныеРасходы</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Прочие</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеОперационныеРасходы</name>
  </enumValues>
  <enumValues>
    <name>НеУчитываемыеВУправленческомУчете</name>
  </enumValues>
  <enumValues>
    <name>ТранспортноЗаготовительныеРасходы</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/СтатьиЗатрат/Forms/ФормаЭлементаУправляемая/Module.bsl
// Процедура управляет доступностью ЭУ в форме
//
// Параметры
//  нет
//
&НаКлиенте
Процедура УправлениеДиалогом()
	
	Если Объект.ВидЗатрат = ПредопределенноеЗначение("Перечисление.ВидыЗатрат.Материальные") 
	   И Объект.ХарактерЗатрат = ПредопределенноеЗначение("Перечисление.ХарактерЗатрат.ПроизводственныеРасходы") Тогда
		Элементы.СтатусМатериальныхЗатрат.Доступность = Истина;
		Элементы.СтатусМатериальныхЗатрат.ОтметкаНезаполненного = Объект.СтатусМатериальныхЗатрат.Пустая();
	Иначе
		Элементы.СтатусМатериальныхЗатрат.Доступность = Ложь;
		Элементы.СтатусМатериальныхЗатрат.ОтметкаНезаполненного = Ложь;
	КонецЕсли;
	
КонецПроцедуры // УправлениеДиалогом()

// Процедура обработчик события "ПриИзменении" реквизита "ВидЗатрат".
&НаКлиенте
Процедура ВидЗатратПриИзменении(Элемент)
	
	Если НЕ Объект.ВидЗатрат = ПредопределенноеЗначение("Перечисление.ВидыЗатрат.Материальные") Тогда
		Объект.СтатусМатериальныхЗатрат = Неопределено;
	КонецЕсли;
	
	УправлениеДиалогом();
	
КонецПроцедуры // ВидЗатратПриИзменении()

// Процедура обработчик события "ПриИзменении" реквизита "ХарактерЗатрат".
&НаКлиенте
Процедура ХарактерЗатратПриИзменении(Элемент)
	
	Если Объект.ХарактерЗатрат <> ПредопределенноеЗначение("Перечисление.ХарактерЗатрат.ПроизводственныеРасходы") Тогда
		Объект.СтатусМатериальныхЗатрат = Неопределено;
	КонецЕсли;
	
	УправлениеДиалогом();
	
КонецПроцедуры // ХарактерЗатратПриИзменении()

// Обработчик события ПриОткрытии Формы.
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеДиалогом();
	ПоказатьСправкуСтатьяДекларации();
КонецПроцедуры

&НаСервере
Функция ПолучитьОписаниеСтатьиДекларации(СтатьяДекларацииПоНалогуНаПрибыль)
	Возврат СтатьяДекларацииПоНалогуНаПрибыль.Описание;
КонецФункции // ПолучитьОписаниеСтатьиДекларации()

&НаКлиенте
Процедура ПоказатьСправкуСтатьяДекларации()
	НадписьСправкаСтатья = ПолучитьОписаниеСтатьиДекларации(Объект.СтатьяДекларацииПоНалогуНаПрибыль);
КонецПроцедуры

&НаКлиенте
Процедура СтатьяДекларацииПоНалогуНаПрибыльПриИзменении(Элемент)
	ПоказатьСправкуСтатьяДекларации();
КонецПроцедуры
